OdDAI.UnderlyingType.domain
\details
Retreives a domain of defined type.
\returns Returns a smart pointer to underlying type of defined type.

OdDAI.UnderlyingType.elementType
\details
Retrieves data type contained in the aggregation type.
\returns Returns a smart pointer to the data type.

OdDAI.UnderlyingType.type
\details
Retreives a type code of contained type.
\returns Returns a smart pointer to type code of contained type.

OdDAI.UnderlyingType
\details
Container for simple, aggregation, defined or constructed type.